Tekla.Structures.Model.RebarHookData.RebarHookShapeEnum
The different hook shapes.

Tekla.Structures.Model.RebarHookData.RebarHookShapeEnum.NO_HOOK
No hook.

Tekla.Structures.Model.RebarHookData.RebarHookShapeEnum.HOOK_90_DEGREES
The standard 90-degree hook.

Tekla.Structures.Model.RebarHookData.RebarHookShapeEnum.HOOK_135_DEGREES
The standard 135-degree hook.

Tekla.Structures.Model.RebarHookData.RebarHookShapeEnum.HOOK_180_DEGREES
The standard 180-degree hook.

Tekla.Structures.Model.RebarHookData.RebarHookShapeEnum.CUSTOM_HOOK
The custom hook shape to manually define the angle, radius and length of a hook.